rowdy15/battery-powered-ble-irrigation-controller-project-with-the-nRF52832/main.c
#include <stdint.h>
#include <string.h>
#include "nrf.h"
#include "nrf_soc.h"
#include "nrf_drv_saadc.h"
#include "app_error.h"
#include "ble.h"
#include "ble_err.h"
#include "ble_hci.h"
#include "ble_srv_common.h"
#include "ble_advdata.h"
#include "ble_bas.h"
#include "ble_conn_params.h"
#include "nrf_sdh.h"
#include "nrf_sdh_soc.h"
#include "nrf_sdh_ble.h"
#include "app_util.h"
#include "nordic_common.h"
#include "boards.h"
#include "app_timer.h"
#include "peer_manager.h"
#include "peer_manager_handler.h"
#include "ble_advertising.h"
#include "nrf_ble_gatt.h"

#include "nrf_drv_rtc.h"
#include "nrf_drv_clock.h"

#include "nrf_ble_qwr.h"
#include "nrf_pwr_mgmt.h"

#include "SEGGER_RTT.h"

#include "fds.h"
#include "nrf_sdm.h"
#include "ble_dis.h"
#include "app_scheduler.h"
#include "ble_conn_state.h"

#include "ble_gap.h"

#include "nrf_log.h"
#include "nrf_log_ctrl.h"
#include "nrf_log_default_backends.h"

#include "ble_cus.h"
#include "ble_opt.h"

#define DEVICE_NAME                     "Front_Garden"                         /**< Name of device. Will be included in the advertising data. */

#define APP_BLE_OBSERVER_PRIO           3                                       /**< Application's BLE observer priority. You shouldn't need to modify this value. */
#define APP_BLE_CONN_CFG_TAG            1                                       /**< A tag identifying the SoftDevice BLE configuration. */

static  uint32_t BATTERY_LEVEL_MEAS_INTERVAL  =  APP_TIMER_TICKS(3600000);   //1 Hour  =   3600000  /**< Battery level measurement interval (ticks). This value corresponds to 60 minutes. */
#define CUSTOM_SERVICE_NOTIFICATION_INTERVAL     APP_TIMER_TICKS(60000) 

#define APP_ADV_FAST_INTERVAL           MSEC_TO_UNITS(500, UNIT_1_25_MS)  // 500 ms                       /**< Fast advertising interval (in units of 0.625 ms. This value corresponds to 25 ms.). */
#define APP_ADV_SLOW_INTERVAL           MSEC_TO_UNITS(4000, UNIT_1_25_MS)  // 5 secs                       /**< Slow advertising interval (in units of 0.625 ms. This value corresponds to 100 ms.). */

#define APP_ADV_FAST_DURATION           MSEC_TO_UNITS(20000, UNIT_10_MS)                                        /**< The advertising duration of fast advertising in units of 10 milliseconds. */
#define APP_ADV_SLOW_DURATION           0                                       /**< The advertising duration of slow advertising in units of 10 milliseconds. 0 means indefinitely. */

#define MIN_CONN_INTERVAL               MSEC_TO_UNITS(2000, UNIT_1_25_MS)        /**< Minimum acceptable connection interval (2 seconds). */
#define MAX_CONN_INTERVAL               MSEC_TO_UNITS(4000, UNIT_1_25_MS)        /**< Maximum acceptable connection interval (4 second). */
#define SLAVE_LATENCY                   1                                       /**< Slave latency. */
#define CONN_SUP_TIMEOUT                MSEC_TO_UNITS(20000, UNIT_10_MS)         /**< Connection supervisory time-out (20 seconds). */

#define FIRST_CONN_PARAMS_UPDATE_DELAY  APP_TIMER_TICKS(15000)                  /**< Time from initiating event (connect or start of notification) to first time sd_ble_gap_conn_param_update is called (15 seconds). */
#define NEXT_CONN_PARAMS_UPDATE_DELAY   APP_TIMER_TICKS(5000)                   /**< Time between each call to sd_ble_gap_conn_param_update after the first call (5 seconds). */
#define MAX_CONN_PARAMS_UPDATE_COUNT    5                                       /**< Number of attempts before giving up the connection parameter negotiation. */

#define ADC_REF_VOLTAGE_IN_MILLIVOLTS   600                                     /**< Reference voltage (in milli volts) used by ADC while doing conversion. */
#define ADC_PRE_SCALING_COMPENSATION    6                                       /**< The ADC is configured to use VDD with 1/3 prescaling as input. And hence the result of conversion is to be multiplied by 3 to get the actual value of the battery voltage.*/
#define DIODE_FWD_VOLT_DROP_MILLIVOLTS  270                                     /**< Typical forward voltage drop of the diode . */
#define ADC_RES_10BIT                   1024                                    /**< Maximum digital value for 10-bit ADC conversion. */

#define LESC_DEBUG_MODE                     0                                       /**< Set to 1 to use LESC debug keys, allows you to use a sniffer to inspect traffic. */

#define BLE_ADV_WHITELIST_ENABLED       true
#define SEC_PARAM_BOND                  1                                       /**< Perform bonding. */
#define SEC_PARAM_MITM                  0                                       /**< Man In The Middle protection not required. */
#define SEC_PARAM_LESC                  0                                       /**< LE Secure Connections not enabled. */
#define SEC_PARAM_KEYPRESS              0                                       /**< Keypress notifications not enabled. */
#define SEC_PARAM_IO_CAPABILITIES       BLE_GAP_IO_CAPS_NONE                    /**< No I/O capabilities. */
#define SEC_PARAM_OOB                   0                                       /**< Out Of Band data not available. */
#define SEC_PARAM_MIN_KEY_SIZE          7                                       /**< Minimum encryption key size. */
#define SEC_PARAM_MAX_KEY_SIZE          16                                      /**< Maximum encryption key size. */

#define DEAD_BEEF                       0xDEADBEEF                              /**< Value used as error code on stack dump, can be used to identify stack location on stack unwind. */

/**@brief Macro to convert the result of ADC conversion in millivolts.
 *
 * @param[in]  ADC_VALUE   ADC result..
 *
 * @retval     Result converted to millivolts.
 */
#define ADC_RESULT_IN_MILLI_VOLTS(ADC_VALUE) ((((ADC_VALUE) * ADC_REF_VOLTAGE_IN_MILLIVOLTS) / ADC_RES_10BIT) * ADC_PRE_SCALING_COMPENSATION)

APP_TIMER_DEF(m_our_char_timer_id);
APP_TIMER_DEF(m_battery_timer_id);                                                /**< Battery measurement timer. */
//APP_TIMER_DEF(m_notification_timer_id);
NRF_BLE_GATT_DEF(m_gatt);                                                         /**< GATT module instance. */
NRF_BLE_QWR_DEF(m_qwr);                                                           /**< Context for the Queued Write module.*/
BLE_BAS_DEF(m_bas);                                                               /**< Battery service instance. */
BLE_ADVERTISING_DEF(m_advertising);                                               /**< Advertising module instance. */
BLE_CUS_DEF(m_cus);                                                               /**< Context for the Queued Write module.*/
BLE_OPT_DEF(m_opt);                                                               /**< Context for the Queued Write module.*/

static uint16_t           m_conn_handle = BLE_CONN_HANDLE_INVALID;                          /**< Handle of the current connection. */
static pm_peer_id_t       m_peer_id;                                               /**< Device reference handle to the current bonded central. */
static bool               m_in_boot_mode = false;                                  /**< Current protocol mode. */
static uint8_t            m_adv_handle = BLE_GAP_ADV_SET_HANDLE_NOT_SET;                     /**< Advertising handle used to identify an advertising set. */
static uint8_t            m_enc_advdata[BLE_GAP_ADV_SET_DATA_SIZE_MAX];                      /**< Buffer for storing an encoded advertising set. */
static uint8_t            m_enc_scan_response_data[BLE_GAP_ADV_SET_DATA_SIZE_MAX];           /**< Buffer for storing an encoded scan data. */

