rowdy15/battery-powered-ble-irrigation-controller-project-with-the-nRF52832/main.c
            err_code = app_timer_start(m_our_char_timer_id, CUSTOM_SERVICE_NOTIFICATION_INTERVAL, NULL);
            APP_ERROR_CHECK(err_code);
            break;

        case BLE_CUS_EVT_NOTIFICATION_DISABLED:
            SEGGER_RTT_WriteString(0,"the custom service has been notify disabled\n");

            err_code = app_timer_stop(m_our_char_timer_id);
            APP_ERROR_CHECK(err_code);
            break;

        case BLE_CUS_LED_ON:
            SEGGER_RTT_WriteString(0,"battery notify disabled.\n");

//            err_code = app_timer_start(m_our_char_timer_id, CUSTOM_SERVICE_NOTIFICATION_INTERVAL, NULL);
//            APP_ERROR_CHECK(err_code);

//            err_code = app_timer_stop(m_battery_timer_id);
//            APP_ERROR_CHECK(err_code);
            break;

        case BLE_CUS_LED_OFF:
            SEGGER_RTT_WriteString(0,"battery notify enabled\n");

            err_code = app_timer_stop(m_our_char_timer_id);
            APP_ERROR_CHECK(err_code);

//            err_code = app_timer_start(m_battery_timer_id, BATTERY_LEVEL_MEAS_INTERVAL, NULL);
//            APP_ERROR_CHECK(err_code);
            break;

        case BLE_CUS_EVT_CONNECTED:
            break;

        case BLE_CUS_EVT_DISCONNECTED:
              break;

        default:
              // No implementation needed.
              break;
    }
}

/**@brief Function for handling the Custom Service Service events.
 *
 * @details This function will be called for all Custom Service events which are passed to
 *          the application.
 *
 * @param[in]   p_cus_service  Custom Service structure.
 * @param[in]   p_evt          Event received from the Custom Service.
 *
 */
static void on_opt_evt(ble_option_t * p_opt_service, ble_opt_evt_t * p_evt)
{
    ret_code_t err_code;
    
    switch(p_evt->evt_type)
    {
        case BLE_OPT_BAT_CHECK_10_MIN:
            BATTERY_LEVEL_MEAS_INTERVAL  =  APP_TIMER_TICKS(600000);
            SEGGER_RTT_WriteString(0,"battery read frequency was changed to 10 min!\n");
            break;
        case BLE_OPT_BAT_CHECK_30_MIN:
            BATTERY_LEVEL_MEAS_INTERVAL  =  APP_TIMER_TICKS(180000);
            SEGGER_RTT_WriteString(0,"battery read frequency was changed to 30 min!\n");
            break;
        case BLE_OPT_BAT_CHECK_1_HR:
            BATTERY_LEVEL_MEAS_INTERVAL  =  APP_TIMER_TICKS(3600000);
            SEGGER_RTT_WriteString(0,"battery read frequency was changed to 1 hour!\n");
            break;
        case BLE_OPT_BAT_CHECK_6_HR:
            BATTERY_LEVEL_MEAS_INTERVAL  =  APP_TIMER_TICKS(21600000);
            SEGGER_RTT_WriteString(0,"battery read frequency was changed to 6 hours!\n");
            break;
        case BLE_OPT_BAT_CHECK_12_HR:
            BATTERY_LEVEL_MEAS_INTERVAL  =  APP_TIMER_TICKS(43200000);
            SEGGER_RTT_WriteString(0,"battery read frequency was changed to 12 hours!\n");
            break;
        case BLE_OPT_BAT_CHECK_24_HR:
            BATTERY_LEVEL_MEAS_INTERVAL  =  APP_TIMER_TICKS(86400000);
            SEGGER_RTT_WriteString(0,"battery read frequency was changed to 24 hours!\n");
            break;
        case BLE_OPT_EVT_CONNECTED:
            break;

        case BLE_OPT_EVT_DISCONNECTED:
              break;
        default:
              // No implementation needed.
              break;
    }
}

/**@brief Function for setting filtered device identities.
 *
 * @param[in] skip  Filter passed to @ref pm_peer_id_list.
 */
static void identities_set(pm_peer_id_list_skip_t skip)
{
    pm_peer_id_t peer_ids[BLE_GAP_DEVICE_IDENTITIES_MAX_COUNT];
    uint32_t     peer_id_count = BLE_GAP_DEVICE_IDENTITIES_MAX_COUNT;

    ret_code_t err_code = pm_peer_id_list(peer_ids, &peer_id_count, PM_PEER_ID_INVALID, skip);
    APP_ERROR_CHECK(err_code);

    err_code = pm_device_identities_list_set(peer_ids, peer_id_count);
    APP_ERROR_CHECK(err_code);
}

/**@brief Clear bond information from persistent storage.
 */
static void delete_bonds(void)
{
    ret_code_t err_code;

    NRF_LOG_INFO("Erase bonds!");

    err_code = pm_peers_delete();
    APP_ERROR_CHECK(err_code);
}

/**@brief Function for starting advertising.
 */
static void advertising_start(bool erase_bonds)
{
    if (erase_bonds == true)
    {
        delete_bonds();
        // Advertising is started by PM_EVT_PEERS_DELETE_SUCCEEDED event.
    }
    else
    {
        whitelist_set(PM_PEER_ID_LIST_SKIP_NO_ID_ADDR);

        ret_code_t ret = ble_advertising_start(&m_advertising, BLE_ADV_MODE_FAST);
        APP_ERROR_CHECK(ret);
    }
}

/**@brief Function for handling Peer Manager events.
 *
 * @param[in] p_evt  Peer Manager event.
 */
static void pm_evt_handler(pm_evt_t const * p_evt)
{
    pm_handler_on_pm_evt(p_evt);
    pm_handler_flash_clean(p_evt);

    ret_code_t err_code;

    switch (p_evt->evt_id)
        {
        case PM_EVT_BONDED_PEER_CONNECTED:
        {
            SEGGER_RTT_WriteString(0,"Connected to a previously bonded device.\n");
        } break;

        case PM_EVT_CONN_SEC_SUCCEEDED:
        {
            SEGGER_RTT_printf(0,"Connection secured: role: %d, conn_handle: 0x%x, procedure: %d.\n",
                         ble_conn_state_role(p_evt->conn_handle),
                         p_evt->conn_handle,
                         p_evt->params.conn_sec_succeeded.procedure);
        } break;

        case PM_EVT_CONN_SEC_FAILED:
        {
            /* Often, when securing fails, it shouldn't be restarted, for security reasons.
             * Other times, it can be restarted directly.
             * Sometimes it can be restarted, but only after changing some Security Parameters.
             * Sometimes, it cannot be restarted until the link is disconnected and reconnected.
             * Sometimes it is impossible, to secure the link, or the peer device does not support it.
             * How to handle this error is highly application dependent. */
        } break;

        case PM_EVT_CONN_SEC_CONFIG_REQ:
        {
            // Reject pairing request from an already bonded peer.
            pm_conn_sec_config_t conn_sec_config = {.allow_repairing = false};
            pm_conn_sec_config_reply(p_evt->conn_handle, &conn_sec_config);
        } break;

